Revit 2026 API

# AnalyticalToPhysicalAssociationManagerRemoveAssociation Method

---

This method will remove the association for the element with the given ElementId.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveAssociation(
	ElementId id
)
```
```vb
Public Sub RemoveAssociation (
	id As ElementId
)
```
```cpp
public:
void RemoveAssociation(
	ElementId^ id
)
```
```fsharp
member RemoveAssociation :
        id : ElementId -> unit
```

#### Parameters

id ElementId
     Id of the element for which we want to remove the association.

| Exception | Condition |
| --- | --- |
| ArgumentException | This element doesn't have an association defined. |
| ArgumentNullException | A non-optional argument was null |

If the id does not have any association, an exception is thrown.

#### Reference

AnalyticalToPhysicalAssociationManager Class

Autodesk.Revit.DB.Structure Namespace